[Killed] BlockStatement
src/gilded_rose.mjs:14:19
     this.items = items;
   }
 
-  updateQuality() {
-    for (const item of this.items) {
-      switch (item.name) {
-        case "Aged Brie":
-          updateAgedBrie(item);
-          break;
-        case "Sulfuras, Hand of Ragnaros":
-          updateSulfuras(item);
-          break;
-        case "Backstage passes to a TAFKAL80ETC concert":
-          updateBackstagePasses(item);
-          break;
-        case "Conjured Mana Cake":
-          updateConjured(item);
-          break;
-        default:
-          updateNormal(item);
-          break;
-      }
-    }
-
-    return this.items;
-  }
+  updateQuality() {}
 }
 
killedBy: Gilded Rose -> normal items foo
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/gilded_rose.mjs:15:36
   }
 
   updateQuality() {
-    for (const item of this.items) {
-      switch (item.name) {
-        case "Aged Brie":
-          updateAgedBrie(item);
-          break;
-        case "Sulfuras, Hand of Ragnaros":
-          updateSulfuras(item);
-          break;
-        case "Backstage passes to a TAFKAL80ETC concert":
-          updateBackstagePasses(item);
-          break;
-        case "Conjured Mana Cake":
-          updateConjured(item);
-          break;
-        default:
-          updateNormal(item);
-          break;
-      }
-    }
+    for (const item of this.items) {}
 
     return this.items;
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 10 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:17:9
   updateQuality() {
     for (const item of this.items) {
       switch (item.name) {
-        case "Aged Brie":
-          updateAgedBrie(item);
-          break;
+        case "Aged Brie":
         case "Sulfuras, Hand of Ragnaros":
           updateSulfuras(item);
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 20 to equal 21

[Killed] ConditionalExpression
src/gilded_rose.mjs:20:9
         case "Aged Brie":
           updateAgedBrie(item);
           break;
-        case "Sulfuras, Hand of Ragnaros":
-          updateSulfuras(item);
-          break;
+        case "Sulfuras, Hand of Ragnaros":
         case "Backstage passes to a TAFKAL80ETC concert":
           updateBackstagePasses(item);
killedBy: Gilded Rose -> Sulfuras Sulfuras never decreases in quality or sellIn
statusReason: expected 9 to equal 10

[Killed] StringLiteral
src/gilded_rose.mjs:20:14
         case "Aged Brie":
           updateAgedBrie(item);
           break;
-        case "Sulfuras, Hand of Ragnaros":
+        case "":
           updateSulfuras(item);
           break;
killedBy: Gilded Rose -> Sulfuras Sulfuras never decreases in quality or sellIn
statusReason: expected 79 to equal 80

[Killed] ConditionalExpression
src/gilded_rose.mjs:23:9
         case "Sulfuras, Hand of Ragnaros":
           updateSulfuras(item);
           break;
-        case "Backstage passes to a TAFKAL80ETC concert":
-          updateBackstagePasses(item);
-          break;
+        case "Backstage passes to a TAFKAL80ETC concert":
         case "Conjured Mana Cake":
           updateConjured(item);
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected 18 to equal 22

[Killed] ConditionalExpression
src/gilded_rose.mjs:26:9
         case "Backstage passes to a TAFKAL80ETC concert":
           updateBackstagePasses(item);
           break;
-        case "Conjured Mana Cake":
-          updateConjured(item);
-          break;
+        case "Conjured Mana Cake":
         default:
           updateNormal(item);
killedBy: Gilded Rose -> Conjured items Conjured items degrade in quality twice as fast as normal items
statusReason: expected 19 to equal 18

[Killed] ConditionalExpression
src/gilded_rose.mjs:29:9
         case "Conjured Mana Cake":
           updateConjured(item);
           break;
-        default:
-          updateNormal(item);
-          break;
+        default:
       }
     }
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 10 to equal 9

[Killed] BlockStatement
src/gilded_rose.mjs:39:32
   }
 }
 
-function increaseQuality(item) {
-  if (item.quality < 50) item.quality++;
-}
+function increaseQuality(item) {}
 
 function decreaseQuality(item) {
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 20 to equal 21

[Killed] ConditionalExpression
src/gilded_rose.mjs:40:7
 }
 
 function increaseQuality(item) {
-  if (item.quality < 50) item.quality++;
+  if (false) item.quality++;
 }
 
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 20 to equal 21

[Killed] EqualityOperator
src/gilded_rose.mjs:40:7
 }
 
 function increaseQuality(item) {
-  if (item.quality < 50) item.quality++;
+  if (item.quality >= 50) item.quality++;
 }
 
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 20 to equal 21

[Killed] BlockStatement
src/gilded_rose.mjs:43:32
   if (item.quality < 50) item.quality++;
 }
 
-function decreaseQuality(item) {
-  if (item.quality > 0) item.quality--;
-}
+function decreaseQuality(item) {}
 
 function updateAgedBrie(item) {
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 20 to equal 19

[Killed] ConditionalExpression
src/gilded_rose.mjs:44:7
 }
 
 function decreaseQuality(item) {
-  if (item.quality > 0) item.quality--;
+  if (false) item.quality--;
 }
 
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 20 to equal 19

[Killed] ConditionalExpression
src/gilded_rose.mjs:44:7
 }
 
 function decreaseQuality(item) {
-  if (item.quality > 0) item.quality--;
+  if (true) item.quality--;
 }
 
killedBy: Gilded Rose -> normal items quality can not be negative
statusReason: expected -1 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:47:31
   if (item.quality > 0) item.quality--;
 }
 
-function updateAgedBrie(item) {
-  increaseQuality(item);
-  item.sellIn--;
-  if (item.sellIn < 0) increaseQuality(item);
-}
+function updateAgedBrie(item) {}
 
 function updateSulfuras(item) {}
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 20 to equal 21

[Killed] UpdateOperator
src/gilded_rose.mjs:49:3
 
 function updateAgedBrie(item) {
   increaseQuality(item);
-  item.sellIn--;
+  item.sellIn++;
   if (item.sellIn < 0) increaseQuality(item);
 }
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 11 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:50:7
 function updateAgedBrie(item) {
   increaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) increaseQuality(item);
+  if (true) increaseQuality(item);
 }
 
killedBy: Gilded Rose -> Aged brie Aged Brie increases in quality the older it gets per day before sell date
statusReason: expected 22 to equal 21

[Killed] ConditionalExpression
src/gilded_rose.mjs:50:7
 function updateAgedBrie(item) {
   increaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) increaseQuality(item);
+  if (false) increaseQuality(item);
 }
 
killedBy: Gilded Rose -> Aged brie Aged Brie after sell date gains 2 quality
statusReason: expected 21 to equal 22

[Killed] BlockStatement
src/gilded_rose.mjs:55:38
 
 function updateSulfuras(item) {}
 
-function updateBackstagePasses(item) {
-  increaseQuality(item);
-  if (item.sellIn < 11) increaseQuality(item);
-  if (item.sellIn < 6) increaseQuality(item);
-  item.sellIn--;
-  if (item.sellIn < 0) {
-    item.quality = 0;
-  }
-}
+function updateBackstagePasses(item) {}
 
 function updateNormal(item) {
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected 20 to equal 22

[Killed] ConditionalExpression
src/gilded_rose.mjs:57:7
 
 function updateBackstagePasses(item) {
   increaseQuality(item);
-  if (item.sellIn < 11) increaseQuality(item);
+  if (true) increaseQuality(item);
   if (item.sellIn < 6) increaseQuality(item);
   item.sellIn--;
killedBy: Gilded Rose -> Backstage passes Backstage passes gain 1 quality when more than 10 days remain
statusReason: expected 22 to equal 21

[Killed] ConditionalExpression
src/gilded_rose.mjs:57:7
 
 function updateBackstagePasses(item) {
   increaseQuality(item);
-  if (item.sellIn < 11) increaseQuality(item);
+  if (false) increaseQuality(item);
   if (item.sellIn < 6) increaseQuality(item);
   item.sellIn--;
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected 21 to equal 22

[Killed] EqualityOperator
src/gilded_rose.mjs:58:7
 function updateBackstagePasses(item) {
   increaseQuality(item);
   if (item.sellIn < 11) increaseQuality(item);
-  if (item.sellIn < 6) increaseQuality(item);
+  if (item.sellIn >= 6) increaseQuality(item);
   item.sellIn--;
   if (item.sellIn < 0) {
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected 23 to equal 22

[Killed] EqualityOperator
src/gilded_rose.mjs:58:7
 function updateBackstagePasses(item) {
   increaseQuality(item);
   if (item.sellIn < 11) increaseQuality(item);
-  if (item.sellIn < 6) increaseQuality(item);
+  if (item.sellIn <= 6) increaseQuality(item);
   item.sellIn--;
   if (item.sellIn < 0) {
killedBy: Gilded Rose -> Backstage passes Mutant: Backstage passes gain 2 quality at 6 days left
statusReason: expected 23 to equal 22

[Killed] UpdateOperator
src/gilded_rose.mjs:59:3
   increaseQuality(item);
   if (item.sellIn < 11) increaseQuality(item);
   if (item.sellIn < 6) increaseQuality(item);
-  item.sellIn--;
+  item.sellIn++;
   if (item.sellIn < 0) {
     item.quality = 0;
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected 11 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:60:7
   if (item.sellIn < 11) increaseQuality(item);
   if (item.sellIn < 6) increaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) {
+  if (true) {
     item.quality = 0;
   }
killedBy: Gilded Rose -> Backstage passes Backstage passes increases in quality by 2 when there are 10 days or less
statusReason: expected +0 to equal 22

[Killed] BlockStatement
src/gilded_rose.mjs:60:24
   if (item.sellIn < 11) increaseQuality(item);
   if (item.sellIn < 6) increaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) {
-    item.quality = 0;
-  }
+  if (item.sellIn < 0) {}
 }
 
killedBy: Gilded Rose -> Backstage passes Backstage passes drop to 0 quality after the concert (on sell date)
statusReason: expected 23 to equal +0

[Killed] BlockStatement
src/gilded_rose.mjs:65:29
   }
 }
 
-function updateNormal(item) {
-  decreaseQuality(item);
-  item.sellIn--;
-  if (item.sellIn < 0) decreaseQuality(item);
-}
+function updateNormal(item) {}
 
 function updateConjured(item) {
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 10 to equal 9

[Killed] UpdateOperator
src/gilded_rose.mjs:67:3
 
 function updateNormal(item) {
   decreaseQuality(item);
-  item.sellIn--;
+  item.sellIn++;
   if (item.sellIn < 0) decreaseQuality(item);
 }
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 11 to equal 9

[Killed] ConditionalExpression
src/gilded_rose.mjs:68:7
 function updateNormal(item) {
   decreaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) decreaseQuality(item);
+  if (true) decreaseQuality(item);
 }
 
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 18 to equal 19

[Killed] EqualityOperator
src/gilded_rose.mjs:68:7
 function updateNormal(item) {
   decreaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) decreaseQuality(item);
+  if (item.sellIn >= 0) decreaseQuality(item);
 }
 
killedBy: Gilded Rose -> normal items before sell date -> quality and sellIn decrease by 1
statusReason: expected 18 to equal 19

[Killed] BlockStatement
src/gilded_rose.mjs:71:31
   if (item.sellIn < 0) decreaseQuality(item);
 }
 
-function updateConjured(item) {
-  decreaseQuality(item);
-  decreaseQuality(item);
-  item.sellIn--;
-  if (item.sellIn < 0) {
-    decreaseQuality(item);
-    decreaseQuality(item);
-  }
-}
+function updateConjured(item) {}
 
killedBy: Gilded Rose -> Conjured items Conjured items degrade in quality twice as fast as normal items
statusReason: expected 20 to equal 18

[Killed] ConditionalExpression
src/gilded_rose.mjs:75:7
   decreaseQuality(item);
   decreaseQuality(item);
   item.sellIn--;
-  if (item.sellIn < 0) {
+  if (false) {
     decreaseQuality(item);
     decreaseQuality(item);
killedBy: Gilded Rose -> Conjured items Conjured items degrade in quality twice as fast
statusReason: expected 18 to equal 16
